9/data/attachments/54952cbc22cdaf7d.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Karen_from_Friend_86165_5</nif:username>
            <nif:friendToBeRequested>soap_friends_c7d0945f-1585-4d18-8a83-78dd6ba0f2f5</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>